Reports/ITC_ОтчетыСубподряд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Report>
		<Properties>
			<Name>ITC_ОтчетыСубподряд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчёта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Трудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Трудозатраты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ITC_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ITC_Задача</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_JIRA</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_CODE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктирования</Name>
					<Comment>customfield_10415</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Comment>resolutiondate</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяОценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Релиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Спринт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сущность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестировщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эпик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ITC_ОтчетыСубподряд/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервере_ТекстЗапроса()
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТрудозатратыОстатки.Ответственный КАК Ответственный,
	|	ТрудозатратыОстатки.Задача КАК Задача,
	|	ТрудозатратыОстатки.ОтчетОстаток КАК Остаток
	|ПОМЕСТИТЬ ВТ_ОстаткиСырые
	|ИЗ
	|	РегистрНакопления.Трудозатраты.Остатки(&Дата, ) КАК ТрудозатратыОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Задача,
	|	Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТрудозатратыОбороты.Ответственный КАК Ответственный,
	|	ТрудозатратыОбороты.Задача КАК Задача,
	|	ТрудозатратыОбороты.ОтчетРасход КАК ОтчетРасход
	|ПОМЕСТИТЬ ВТ_ОборотыСырые
	|ИЗ
	|	РегистрНакопления.Трудозатраты.Обороты(&ДатаНачала, &ДатаОкончания, Период, ) КАК ТрудозатратыОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Задача,
	|	Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОстаткиСырые.Задача, ВТ_ОборотыСырые.Задача) КАК Задача,
	|	ЕСТЬNULL(ВТ_ОстаткиСырые.Ответственный, ВТ_ОборотыСырые.Ответственный) КАК Ответственный,
	|	ЕСТЬNULL(ВТ_ОстаткиСырые.Остаток, 0) КАК Остаток,
	|	ЕСТЬNULL(ВТ_ОборотыСырые.ОтчетРасход, 0) КАК Актировано
	|ПОМЕСТИТЬ ВТ_ПредИтог
	|ИЗ
	|	ВТ_ОстаткиСырые КАК ВТ_ОстаткиСырые
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОборотыСырые КАК ВТ_ОборотыСырые
	|		ПО ВТ_ОстаткиСырые.Задача = ВТ_ОборотыСырые.Задача
	|			И ВТ_ОстаткиСырые.Ответственный = ВТ_ОборотыСырые.Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТрудозатратыОстатки.Ответственный КАК Ответственный,
	|	ТрудозатратыОстатки.Задача КАК Задача,
	|	ВЫБОР
	|		КОГДА ТрудозатратыОстатки.Задача.Родитель = ЗНАЧЕНИЕ(Справочник.ITC_Задача.ПустаяСсылка)
	|			ТОГДА ТрудозатратыОстатки.Задача
	|		ИНАЧЕ ТрудозатратыОстатки.Задача.Родитель
	|	КОНЕЦ КАК ГоловнаяЗадача,
	|	ТрудозатратыОстатки.Остаток КАК Остаток,
	|	ТрудозатратыОстатки.Актировано КАК Актировано
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	ВТ_ПредИтог КАК ТрудозатратыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Остатки.Ответственный КАК Ответственный,
	|	ВТ_Остатки.Ответственный.Наименование КАК ОтветственныйНаименование,
	|	ВТ_Остатки.ГоловнаяЗадача КАК ГоловнаяЗадача,
	|	ВТ_Остатки.ГоловнаяЗадача.JIRA_ID КАК ГоловнойКод,
	|	ВТ_Остатки.ГоловнаяЗадача.Наименование КАК ГоловнойНаименование,
	|	ВТ_Остатки.ГоловнаяЗадача.Статус.Наименование КАК ГоловнойСтатус,
	|	ВТ_Остатки.Задача.JIRA_ID КАК Код,
	|	ВТ_Остатки.Задача.Наименование КАК Наименование,
	|	ВТ_Остатки.Остаток КАК Остаток,
	|	ВТ_Остатки.Актировано КАК Актировано
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|ИТОГИ
	|	СУММА(Остаток),
	|	СУММА(Актировано)
	|ПО
	|	Ответственный,
	|	ГоловнаяЗадача";
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	яЗ = Новый Запрос;
	яГраница = новый Граница(КонецДня(Отчет.ДатаОтчёта), ВидГраницы.Включая);
	яГраницаНачМесяц = новый Граница(НачалоМесяца(Отчет.ДатаОтчёта), ВидГраницы.Включая);
	яГраницаКонМесяц = новый Граница(КонецМесяца(Отчет.ДатаОтчёта), ВидГраницы.Включая);
	яЗ.УстановитьПараметр("Дата", яГраница);
	яЗ.УстановитьПараметр("ДатаНачала", яГраницаНачМесяц);
	яЗ.УстановитьПараметр("ДатаОкончания", яГраницаКонМесяц);
	яЗ.Текст = СформироватьНаСервере_ТекстЗапроса();
	
	яОтчет = РеквизитФормыВЗначение("Отчет");
	яМакет = яОтчет.ВозвратМакета("НезавершённоеПроизводство");
	
	яОблШапка = яМакет.ПолучитьОбласть("Шапка");
	яОблОтветственный = яМакет.ПолучитьОбласть("Ответственный");
	яОблЗадача = яМакет.ПолучитьОбласть("Задача");
	яОблГоловнаяЗадача = яМакет.ПолучитьОбласть("ГоловнаяЗадача");
		
	РезультатОтчета.Очистить();
	яОблШапка.Параметры.Дата = Формат(Отчет.ДатаОтчёта, "ДФ=yyyy-MM-dd");
	РезультатОтчета.Вывести(яОблШапка);
	
	яРезЗап = яЗ.Выполнить();
	яВыборкаОтветственный = яРезЗап.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ответственный");
	
	Пока яВыборкаОтветственный.Следующий() Цикл
		яОблОтветственный.Параметры.Заполнить(яВыборкаОтветственный);
		РезультатОтчета.Вывести(яОблОтветственный);
		
		яВыборкаГоловная = яВыборкаОтветственный.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ГоловнаяЗадача");
		Пока яВыборкаГоловная.Следующий() Цикл
			яОблГоловнаяЗадача.Параметры.Заполнить(яВыборкаГоловная);
			РезультатОтчета.Вывести(яОблГоловнаяЗадача);
			
			яВ = яВыборкаГоловная.Выбрать();
			Пока яВ.Следующий() Цикл
				яОблЗадача.Параметры.Заполнить(яВ);
				РезультатОтчета.Вывести(яОблЗадача);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ДатаОтчёта = ТекущаяДатаСеанса();
КонецПроцедуры
